bench/results/sharegpt_1.5b_w4gptq_5090_rinf.log
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30070, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bench5090/data/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/rwkv7-1.5b-w4gptq', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:30070/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30070, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bench5090/data/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/rwkv7-1.5b-w4gptq', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 198233
#Output tokens: 110378
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [00:14<00:00, 35.61it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     500       
Benchmark duration (s):                  14.05     
Total input tokens:                      198233    
Total input text tokens:                 198233    
Total generated tokens:                  110378    
Total generated tokens (retokenized):    109730    
Request throughput (req/s):              35.60     
Input token throughput (tok/s):          14112.41  
Output token throughput (tok/s):         7857.92   
Peak output token throughput (tok/s):    19104.00  
Peak concurrent requests:                500       
Total token throughput (tok/s):          21970.33  
Concurrency:                             278.98    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7837.44   
Median E2E Latency (ms):                 7319.64   
P90 E2E Latency (ms):                    11890.45  
P95 E2E Latency (ms):                    12511.05  
P99 E2E Latency (ms):                    13271.01  
---------------Time to First Token----------------
Mean TTFT (ms):                          2571.67   
Median TTFT (ms):                        2534.53   
P90 TTFT (ms):                           4392.77   
P95 TTFT (ms):                           4470.31   
P99 TTFT (ms):                           4496.68   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          75.10     
Median TPOT (ms):                        26.40     
P90 TPOT (ms):                           168.69    
P95 TPOT (ms):                           277.17    
P99 TPOT (ms):                           838.00    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           24.09     
Median ITL (ms):                         15.30     
P90 ITL (ms):                            21.67     
P95 ITL (ms):                            23.44     
P99 ITL (ms):                            25.45     
Max ITL (ms):                            4089.35   
==================================================